nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/adchs/processor/adchs_p32mz1064daa176.h
PLIB_INLINE_API bool _PLIB_UNSUPPORTED PLIB_ADCHS_DMASourceDisable(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID channelID)
{
     return ADCHS_DMASourceDisable_Unsupported(index, channelID);
}

PLIB_INLINE_API bool _PLIB_UNSUPPORTED PLIB_ADCHS_DMABuffer_A_InterruptEnable(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID channelID)
{
     return ADCHS_DMABuffer_A_InterruptEnable_Unsupported(index, channelID);
}

PLIB_INLINE_API bool _PLIB_UNSUPPORTED PLIB_ADCHS_DMABuffer_A_InterruptDisable(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID channelID)
{
     return ADCHS_DMABuffer_A_InterruptDisable_Unsupported(index, channelID);
}

PLIB_INLINE_API bool _PLIB_UNSUPPORTED PLIB_ADCHS_DMABuffer_B_InterruptEnable(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID channelID)
{
     return ADCHS_DMABuffer_B_InterruptEnable_Unsupported(index, channelID);
}

PLIB_INLINE_API bool _PLIB_UNSUPPORTED PLIB_ADCHS_DMABuffer_B_InterruptDisable(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID channelID)
{
     return ADCHS_DMABuffer_B_InterruptDisable_Unsupported(index, channelID);
}

PLIB_INLINE_API int8_t _PLIB_UNSUPPORTED PLIB_ADCHS_DMABuffer_A_IsFull(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID channelID)
{
     return ADCHS_DMABuffer_A_IsFull_Unsupported(index, channelID);
}

PLIB_INLINE_API int8_t _PLIB_UNSUPPORTED PLIB_ADCHS_DMABuffer_B_IsFull(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID channelID)
{
     return ADCHS_DMABuffer_B_IsFull_Unsupported(index, channelID);
}

PLIB_INLINE_API bool _PLIB_UNSUPPORTED PLIB_ADCHS_DMAOverflowErrorHasOccurred(ADCHS_MODULE_ID index)
{
     return ADCHS_DMAOverflowErrorHasOccurred_Unsupported(index);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsDMA(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsDMA_Unsupported(index);
}

PLIB_INLINE_API void PLIB_ADCHS_CVDEnable(ADCHS_MODULE_ID index)
{
     ADCHS_CVDEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_CVDDisable(ADCHS_MODULE_ID index)
{
     ADCHS_CVDDisable_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_CVDSetup(ADCHS_MODULE_ID index, ADCHS_CVD_CAPACITOR capSel, bool inBetweenOrEqual, bool greaterEqualHi, bool lessThanHi, bool greaterEqualLo, bool lessThanLo, ADCHS_AN_INPUT_ID inputEnable, int16_t hiLimit, int16_t loLimit)
{
     ADCHS_CVDSetup_Default(index, capSel, inBetweenOrEqual, greaterEqualHi, lessThanHi, greaterEqualLo, lessThanLo, inputEnable, hiLimit, loLimit);
}

PLIB_INLINE_API int16_t PLIB_ADCHS_CVDResultGet(ADCHS_MODULE_ID index)
{
     return ADCHS_CVDResultGet_Default(index);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsCVD(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsCVD_Default(index);
}

PLIB_INLINE_API bool PLIB_ADCHS_VREFIsReady(ADCHS_MODULE_ID index)
{
     return ADCHS_VREFIsReady_Default(index);
}

PLIB_INLINE_API bool PLIB_ADCHS_VREFFaultHasOccurred(ADCHS_MODULE_ID index)
{
     return ADCHS_VREFFaultHasOccurred_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_VREFReadyInterruptEnable(ADCHS_MODULE_ID index)
{
     ADCHS_VREFReadyInterruptEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_VREFReadyInterruptDisable(ADCHS_MODULE_ID index)
{
     ADCHS_VREFReadyInterruptDisable_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_VREFFaultInterruptEnable(ADCHS_MODULE_ID index)
{
     ADCHS_VREFFaultInterruptEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_VREFFaultInterruptDisable(ADCHS_MODULE_ID index)
{
     ADCHS_VREFFaultInterruptDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsVREFControl(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsVREFControl_Default(index);
}

PLIB_INLINE_API bool PLIB_ADCHS_AnalogInputScanIsComplete(ADCHS_MODULE_ID index)
{
     return ADCHS_AnalogInputScanIsComplete_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_AnalogInputScanSelect(ADCHS_MODULE_ID index, ADCHS_AN_INPUT_ID analogInput)
{
     ADCHS_AnalogInputScanSelect_Default(index, analogInput);
}

PLIB_INLINE_API void PLIB_ADCHS_AnalogInputScanRemove(ADCHS_MODULE_ID index, ADCHS_AN_INPUT_ID analogInput)
{
     ADCHS_AnalogInputScanRemove_Default(index, analogInput);
}

PLIB_INLINE_API bool PLIB_ADCHS_AnalogInputScanIsSelected(ADCHS_MODULE_ID index, ADCHS_AN_INPUT_ID analogInput)
{
     return ADCHS_AnalogInputScanIsSelected_Default(index, analogInput);
}

PLIB_INLINE_API void PLIB_ADCHS_AnalogInputScanSetup(ADCHS_MODULE_ID index, ADCHS_AN_INPUT_ID analogInput, ADCHS_SCAN_TRIGGER_SENSITIVE trgSensitive, ADCHS_SCAN_TRIGGER_SOURCE triggerSource)
{
     ADCHS_AnalogInputScanSetup_Default(index, analogInput, trgSensitive, triggerSource);
}

PLIB_INLINE_API void PLIB_ADCHS_ScanCompleteInterruptEnable(ADCHS_MODULE_ID index)
{
     ADCHS_ScanCompleteInterruptEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_ScanCompleteInterruptDisable(ADCHS_MODULE_ID index)
{
     ADCHS_ScanCompleteInterruptDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsAnalogInputScan(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsAnalogInputScan_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_ChannelAnalogFeatureEnable(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID channelID)
{
     ADCHS_ChannelAnalogFeatureEnable_Default(index, channelID);
}

PLIB_INLINE_API void PLIB_ADCHS_ChannelAnalogFeatureDisable(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID channelID)
{
     ADCHS_ChannelAnalogFeatureDisable_Default(index, channelID);
}

PLIB_INLINE_API bool PLIB_ADCHS_ChannelIsReady(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID channelID)
{
     return ADCHS_ChannelIsReady_Default(index, channelID);
}

PLIB_INLINE_API void PLIB_ADCHS_ChannelIsReadyInterruptEnable(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID channelID)
{
     ADCHS_ChannelIsReadyInterruptEnable_Default(index, channelID);
}

PLIB_INLINE_API void PLIB_ADCHS_ChannelIsReadyInterruptDisable(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID channelID)
{
     ADCHS_ChannelIsReadyInterruptDisable_Default(index, channelID);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsChannelAnalogControl(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsChannelAnalogControl_Default(index);
}

PLIB_INLINE_API void PLIB_ADCHS_ChannelDigitalFeatureEnable(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID channelID)
{
     ADCHS_ChannelDigitalFeatureEnable_Default(index, channelID);
}

PLIB_INLINE_API void PLIB_ADCHS_ChannelDigitalFeatureDisable(ADCHS_MODULE_ID index, ADCHS_CHANNEL_ID channelID)
{
     ADCHS_ChannelDigitalFeatureDisable_Default(index, channelID);
}

PLIB_INLINE_API bool PLIB_ADCHS_ExistsChannelDigitalControl(ADCHS_MODULE_ID index)
{
     return ADCHS_ExistsChannelDigitalControl_Default(index);
}

